{"Albany Adder": {"description": "A small adder averaging around 25 cm with a maximum length of 34 cm. The Albany Adder is endemic to the Eastern Cape in the Algoa Bay region where it occupies Albany-thicket and Bontveld grasslands.", "type": "Non Venomous"}, "Anchieta’s Dwarf Python": {"description": "A small python that averages 1.2 m with a maximum length of around 1.8 m. This protected snake inhabits riverine bush and rugged rocky habitat in Namibia where it hunts for warm-blooded prey such as rodents and birds.", "type": "Non Venomous"}, "Anchieta’s Cobra": {"description": "The Anchieta’s Cobra is very similar to the Snouted Cobra in both appearance and behaviour. It occurs from central Namibia into Angola, northern Botswana, Zambia and north-western Zimbabwe.", "type": "Venomous"}, "Angola Green Snake": {"description": "A bright emerald green snake that often has dark markings on the first third of the body and some light speckling between the scales. It is a stocky snake that averages 60-90 cm but may exceed 1.2 m in length.", "type": "Non Venomous"}, "Aurora House Snake": {"description": "A beautifully-marked slow-moving snake that favours damp localities in grasslands, lowland forest and fynbos where it hunts for nestling rodents, lizards and frogs at night. Adults average 60 cm but may exceed 90 cm.", "type": "Non Venomous"}, "Beetz’s Tiger Snake": {"description": "A beautifully-marked nocturnal snake that averages 40-60 cm with a maximum length of 68 cm. It inhabits the rocky arid regions of Namaqualand and the Karoo extending into southern Namibia. This snake is quite common in some areas and often killed at night on roads by passing vehicles.", "type": "Non Venomous"}, "Berg Adder": {"description": "There are at least four isolated populations of the Berg Adder, largely occurring at high altitudes except for the Western Cape and Eastern Cape where they may occur at sea level. This snake averages 30 – 40 cm, reaching 60 cm in length. It is fond of basking, especially on mountain paths and rocky ledges.", "type": "Non Venomous"}, "Bibron’s Blind Snake": {"description": "This harmless burrowing snake spends most of its life underground where it feeds on ants, termites and their larvae. It is often flushed to the surface after heavy rains. As the common name indicates it is largely blind as scales cover the eyes – an adaptation for an underground existence. Bibron’s Blind Snake averages 30 – 38 cm with a maximum length of 48.4 cm.", "type": "Non Venomous"}, "Bibron’s Stiletto Snake": {"description": "After the Mozambique Spitting Cobra and Puff Adder, the Stiletto Snake accounts for the majority of serious snakebites in South Africa. It spends most of its life underground but often emerges on hot humid nights and may be stepped on.", "type": "Non Venomous"}, "Bicoloured Quill-snouted Snake": {"description": "A colourful nocturnal snake that is usually dark brown or black on top, with yellow or white sides. It is fossorial, only coming to the surface on hot, moist summer nights.", "type": "Non Venomous"}, "Black File Snake": {"description": "A small file snake that averages 50 cm, with a maximum length of 65 cm. The Black File Snake is relatively rare but may be caught in traps on reptile surveys or found crossing roads at night. It is nocturnal and hunts for prey such as lizards and frogs. When confronted it moves in jerky movements and will hide its head under its coils. It will also emit a foul-smelling liquid if handled.", "type": "Non Venomous"}, "Black Mamba": {"description": "This is by far the largest venomous snake in Africa with a maximum length of 4.5 m (specimens over 3.8 m are rare). Despite its reputation it is a shy, elusive snake that is quick to escape but will not hesitate to strike repeatedly if cornered.", "type": "Venomous"}, "Black Spitting Cobra": {"description": "The Black Spitting Cobra occurs north-east from Cape Town through the Cederberg and northwards into much of Namaqualand extending east to Upington, Tswalu and Witsand Nature Reserves and north into southern Namibia.", "type": "Venomous"}, "Black Thread Snake": {"description": "This snake spends most of its time underground and is rarely seen. It may be found under rocks or logs or in deserted termite mounds or may come to the surface after heavy rains. It is endemic to South Africa.", "type": "Non Venomous"}, "Black-headed Centipede-eater": {"description": "A small slender nocturnal snake that averages 30 cm with a maximum length of 40 cm. This common snake is usually found in deserted termite mounds or under logs and rocks as well as in leaf litter. It occurs in the eastern half of the country from the Eastern Cape northwards.", "type": "Non Venomous"}, "Black-necked Spitting Cobra": {"description": "This snake is a large cobra that may exceed 2 m in length. The Black-necked Spitting Cobra is active both during the day and at night and covers fair distances in search of food. It is also at home in trees.", "type": "Venomous"}, "Boomslang": {"description": "The Boomslang is largely tree-living but may descend to the ground to bask. In trees it poses no threat to humans as it is extremely reluctant to bite.", "type": "Venomous"}, "Boulenger’s Garter Snake": {"description": "Boulenger’s garter snake is secretive and seldom encountered. Juveniles have 12 – 17 white or pale-yellow bands on the body and tail that fade with age. Adults are usually plain blackish brown or dark brown with a lighter belly and may have 8 – 17 narrow, pale white bands. It is a fossorial snake that may emerge at night from an underground shelter or deserted termite mound.", "type": "Non Venomous"}, "Brown Forest Cobra": {"description": "This is our largest cobra species and may exceed 2.7 m in length. Adults are a light to medium shiny brown that darkens, becoming black towards the tail. The Brown Forest Cobra is active both during the day and night and favours dense bush where it hunts for small mammals, birds, frogs and other snakes. It is extremely shy and quick to escape – bites are rare.", "type": "Venomous"}, "Brown House Snake": {"description": "This is one of the most common and widespread snakes in Africa. It varies in colour from black to brown, olive-green, russet-red and beige. It has a light stripe from the nose through the top of the eye to the back of the head, a unique feature of the Brown House Snakes.", "type": "Non Venomous"}, "Brown Water Snake": {"description": "A smallish snake averaging 30-50 cm with a maximum length of 97 cm. It is light to dark brown with a salmon-pink to yellow coloured belly. Snakes from the Western Cape are often much darker.", "type": "Non Venomous"}, "Bug-eyed House Snake": {"description": "The Bug-eyed House Snake is found in the dry scrub of the Northern Cape, adjacent Western Cape and Namibia. It inhabits Namaqua flats and rocky outcrops.", "type": "Non Venomous"}, "Cape Cobra": {"description": "This snake varies in colour from near black to dark or light brown, beige, yellow or speckled while juveniles have a dark band on the throat. The Cape Cobra is easily confused with the Mole Snake and the Black Spitting Cobra.", "type": "Venomous"}, "Cape Coral Snake": {"description": "A colourful nocturnal snake that is widespread in the drier western part of southern Africa. It shelters under rocks during the day and moves around at night, often seen crossing roads.", "type": "Non Venomous"}, "Cape Sand Snake": {"description": "A long and slender snake that averages 50-80 cm with a maximum length of 1 m. There are two or three distinct pale crossbars on the sides of the head.", "type": "Non Venomous"}, "Common Egg-eater": {"description": "This is one of the most common and widespread snakes in Africa. There are a few Egg-eaters in Africa with quite similar patterns.", "type": "Non Venomous"}, "Common File Snake": {"description": "A large, secretive snake that spends much of its life underground, emerging on warm summer nights. It feeds on frogs, rodents and snakes including venomous ones.", "type": "Non Venomous"}, "Common Night Adder": {"description": "Despite the common name, the Night Adder is more active during the day. It averages 30 – 60 cm in length, but can reach 1 m. It can be identified by the distinct dark V-marking on the head.", "type": "Non Venomous"}, "Common Purple-glossed Snake": {"description": "The Common Purple-glossed Snake is a large fossorial snake, averaging 50–75 cm in length. It lives underground or in thick leaf litter where it hunts for lizards and snakes.", "type": "Non Venomous"}, "Common Slug-eater": {"description": "A small snake that averages 30 – 35 cm. It feeds exclusively on snails and slugs and locates them by following the slime trail. The Common Slug-eater favours damp localities in the south-eastern half of southern Africa.", "type": "Non Venomous"}, "Common Wolf Snake": {"description": "A small widespread nocturnal snake that averages 25–40 cm in length. It is generally black or brown in colour, often with faint white markings", "type": "Non Venomous"}, "Cross-marked Grass Snake": {"description": "One of the smaller grass snakes averaging 30-50 cm but exceeding 82 cm in length. It is active in the day and feeds on small lizards, especially skinks, as well as frogs. It inhabits lowland forest, moist savanna, montane forest, grassland and fynbos. It is common in the sandy scrub-covered areas of the Cape coast and mountain plateau of Mpumalanga.", "type": "Non Venomous"}, "Delalande’s Beaked Blind Snake": {"description": "A widespread burrowing snake that spends most of its life underground in search of ants and their eggs. Individuals may be found in soil under rocks or logs, in deserted termite mounds or on the surface at night, especially after rains.", "type": "Non Venomous"}, "Desert Mountain Adder": {"description": "The Desert Mountain Adder averages 40 cm with a maximum length of just over 60 cm. It inhabits mountain slopes and sparsely vegetated rocky hillsides along the Orange River valley from Augrabies to the Richtersveld and into southern Namibia along the Fish River Valley.", "type": "Non Venomous"}, "Dusky-bellied Water Snake": {"description": "The largest of our water snakes, averaging 30-60 cm but reaching 1.2 m in length. It is largely aquatic and favours pools and shaded streams where it often swims submerged. Although harmless the Dusky-bellied Water Snake bites readily.", "type": "Non Venomous"}, "Dwarf Beaked Snake": {"description": "A small well-patterned snake that averages 30-35cm but may reach 50cm in length. This species varies in colour, from tan-brown to reddish with darker splotches. There is usually a light V on the base of the head.", "type": "Non Venomous"}, "Dwarf Sand Snake": {"description": "A beautifully marked little snake with a broad dark brown stripe down the centre of the back. The neck has one or two dark collars with two thin white stripes across the head.", "type": "Non Venomous"}, "East African Egg-eater": {"description": "A harmless egg specialist that averages 60 cm but may reach 90 cm in length. This snake occurs from St. Lucia Village in Zululand northwards into Mozambique, eastern Zimbabwe and elsewhere further north where it favours lowland evergreen forest and moist savanna.", "type": "Non Venomous"}, "East-African Shovel-snout": {"description": "A smallish snake averaging around 18-25 cm reaching 35 cm. This snake inhabits lowland forest and moist savanna where it may be found under rocks or logs or in leaf litter. It is extremely docile and rarely attempts to bite. Unlike the other shovel-snouted snakes this snake does not coil and uncoil when threatened.", "type": "Non Venomous"}, "Eastern Bark Snake": {"description": "A slender and docile snake that averages around 30cm but can exceed 40cm in length. These secretive snakes hide under bark and in the cracks of trees. They hunt lizards and skinks and have been observed using the orange tail tip to lure lizards into striking range. They often hang from branches whilst swallowing prey.", "type": "Non Venomous"}, "Eastern Natal Green Snake": {"description": "Description not available.", "type": "Non Venomous"}, "Eastern Purple-glossed Snake": {"description": "A rare burrowing species that is seldom encountered except after heavy rains or when soil is excavated. This snake averages around 30 cm in length, but may reach a length of 33 cm. It is usually uniform black with a purplish sheen and white to yellow flanks.", "type": "Non Venomous"}, "Eastern Stripe-bellied Sand Snake": {"description": "Like the other sand snakes this snake is very quick and active during the day, usually disappearing into the closest shrub when disturbed. It may be locally abundant.", "type": "Non Venomous"}, "Eastern Tiger Snake": {"description": "The Eastern Tiger Snake is an attractive nocturnal snake that averages 50-70 cm in length. It is a good climber and is often found in the rafters of buildings where it hunts for geckos and bats.", "type": "Non Venomous"}, "Eastern Vine Snake": {"description": "This perfectly-camouflaged tree-living snake is seldom seen because of its excellent camouflage and habit of remaining very still in low shrubs, observing the ground below for passing lizards and snakes.", "type": "Non Venomous"}, "Fisk’s House Snake": {"description": "An uncommon and secretive snake that is active at night. Most known individuals have been found crossing roads or killed by vehicles. It was first described in 1887 from Touws River and Matjiesfontein but two individuals were found near Springbok back in 1982.", "type": "Non Venomous"}, "Flowerpot Snake": {"description": "One of few successful invasive snakes that came in with the soil of ornamental flowers, hence the common name. ", "type": "Non Venomous"}, "Fork-marked Sand Snake": {"description": "A slender, fast-moving diurnal snake that averages 50-80 cm, but may reach a length of 1.1 meters. It occurs largely in Kalahari thornveld and arid grasslands of the western Free State, Northern Cape and further north extending into Botswana and Namibia. Like many of the sand snakes, this species has stripes running down the length of the body.", "type": "Non Venomous"}, "Fornasini’s Beaked Blind Snake": {"description": "A uniform grey to dark brown or blackish snake that may have irregular yellow blotches, especially on the throat and in the anal region. It is a small snake averaging 15 cm with a maximum length of 18 cm. This snake inhabits coastal forest and moist savanna in northern Zululand, Mozambique and south-eastern Zimbabwe.", "type": "Non Venomous"}, "Gaboon Adder": {"description": "A large, robust adder that averages 1 meter, but may reach 1.7 m. This beautifully-coloured snake occurs in savanna, coastal and montane forest.", "type": "Venomous"}, "Green Mamba": {"description": "A bright green snake that in South Africa inhabits coastal KZN and is usually only found within a few kilometres of the sea.  In Mozambique and Zimbabwe, the distribution may extend further inland. It is often confused with harmless green snakes of the genus Philothamnus and the green Boomslang.", "type": "Venomous"}, "Green Water Snake": {"description": "A smallish bright green snake that averages 25-40 cm in length with a maximum length of 1 m. It is day-active and favours damp localities such as reed swamps, riverine thickets and flood plains where it feeds mainly on frogs. It also eats fish, small lizards and juveniles reportedly eat grasshoppers.", "type": "Non Venomous"}, "Herald or Red-lipped Snake": {"description": "A nocturnal snake that frequents suburban gardens, especially those with water features. It is a toad specialist and often eats toads that look far too large to swallow.", "type": "Non Venomous"}, "Highveld Garter Snake": {"description": "The Highveld Garter Snake is secretive and seldom encountered. Juveniles have 16 – 23 pinkish or orange-yellow bands on the body and tail that fade with age. Adults are usually plain blackish brown or dark brown with a lighter belly while some may still have traces of banding.", "type": "Non Venomous"}, "Horned Adder": {"description": "A small adder, averaging 25 – 40 cm with a maximum length of nearly 60 cm and usually has two prominent horns – one above each eye. It is widespread occurring from the Eastern Cape to the Western Cape, Northern Cape, North West, Gauteng and Limpopo, as well as further north.", "type": "Non Venomous"}, "Intermediate Shield-nose Snake": {"description": "A smallish nocturnal snake that averages 30 – 45 cm in length and with a maximum length of 59 cm. It spends most of its time foraging in loose sand in search of small mammals, frogs and especially legless lizards, using its large rostral scale as a bulldozer.", "type": "Non Venomous"}, "Jan’s Shovel-snout": {"description": "A colourful snake that averages 18-25 cm in length but can reach just over 30 cm. It lives in loose sand and leaf litter in coastal forest and moist savanna. It usually remains just below the surface in loose sandy soil but may be seen on roads on warm summer nights.", "type": "Non Venomous"}, "Karoo Sand Snake": {"description": "A slender snake that averages 40-60 cm with a maximum length of just over 1 m. It is very fast moving and active in the day when it hunts for lizards, including lacertids, skinks and agamas, but will also take small rodents. In some areas it is by far the most common snake and prefers hard, stony ground. Many individuals are killed by vehicles while crossing roads.", "type": "Non Venomous"}, "Kunene Coral Snake": {"description": "The Kunene Coral Snake occurs throughout much of Namibia and into Angola. It averages 60 cm but may exceed 75 cm in length. It is a nocturnal snake that favours rocky areas in savanna and karoo scrub and is active at night. It is often seen crossing roads.", "type": "Non Venomous"}, "Lined Shovel-snout": {"description": "This is a small snake of around 20 – 25 cm but reaching a maximum length of 35 cm. There are three colour forms. The Zimbabwe animals are light brown with dark spots down the back. Another form is grey to blue with a pale stripe down the back. The last form is dark, sometimes with fine white speckling.", "type": "Non Venomous"}, "Long-tailed Garter Snake": {"description": "One of the larger Garter snakes that averages 50 cm but may reach 1 m in length. It is confined to the wetter central eastern parts of southern Africa and is active at night.", "type": "Non Venomous"}, "Long-tailed Thread Snake": {"description": "One of the larger thread snakes averaging 15–20 cm with a maximum length of 25.5 cm. It is lilac grey to flesh pink in colour with a uniform grey to pink belly.", "type": "Non Venomous"}, "Many-horned Adder": {"description": "A small adder that averages 30 – 40 cm, but may reach up to 75 cm, with characteristic clusters of horns above each eye. This is a common snake in Namaqualand and extends into southern Namibia. Though largely active at night, it is fond of basking during the day. It favours rocky areas and gravel flats. This little adder is often seen crossing roads in summer and many individuals are killed by passing vehicles.", "type": "Non Venomous"}, "Many-spotted Reed Snake": {"description": "A slow-moving somewhat secretive snake but locally common and may be mistaken for a Spotted Skaapsteker.  Adults average around 40 cm, but may reach a length of 63 cm. This snake is often found in reed beds and riverine vegetation but also found in fynbos and montane grassland.", "type": "Non Venomous"}, "Marbled Tree Snake": {"description": "This attractive nocturnal snake averages 50 – 60 cm but may reach 85 cm in length. Adults are red-brown to light brown with faint whitish crossbars, but juveniles may have very dark crossbars. It is an excellent climber that often shelters in hollow trees or under loose bark, as well as in thatched roofs. It hunts for lizards, especially geckos, and frogs at night.", "type": "Non Venomous"}, "Mole Snake": {"description": "The Mole snake is a muscular day-active snake that spends much of its time down rodent burrows in search of food. It is widespread and occurs throughout most of Southern Africa. It is often encountered in the Cape, but not seen commonly elsewhere in the country.", "type": "Non Venomous"}, "Mozambique Spitting Cobra": {"description": "The Mozambique Spitting Cobra is fairly common across its range. The diet of this snake consists largely of frogs, small mammals, birds and snakes, including the Puff Adder. It is active on overcast days, but more active at night, often ending up in houses where people are bitten while asleep.", "type": "Venomous"}, "Namaqua Dwarf Adder": {"description": "This is the smallest adder in the world, averaging around 15-20 cm in length. It occurs in coastal dunes in Namaqualand and southern Namibia where it feeds on lizards and rain frogs. It is preyed upon by a variety of small carnivores and predatory birds as well as other snakes, but the biggest threat comes from habitat destruction, crossing roads and illegal collecting for the pet trade.", "type": "Non Venomous"}, "Namib Sand Snake": {"description": "A long and slender snake that averages 50-80 cm with a maximum length of 1.4 m. It has a light W pattern on the side of the head behind the eye. It occurs in arid Namib Desert and Karoo vegetation at low altitudes on the west coast of Namibia. The Namib Sand Snake hunts for lizards, rodents and snakes during the day, often with the front third of the body well off the ground.", "type": "Non Venomous"}, "Natal Black Snake": {"description": "A secretive snake that spends most of its life underground in the cooler regions of coastal KZN and the Eastern Cape. This snake may be found under rotting logs or when doing excavations, otherwise it moves about slowly on warm, overcast days. It is also a good swimmer. The Natal Black Snake feeds on frogs, legless lizards and small rodents and is known to take carrion.", "type": "Non Venomous"}, "Natal Purple-glossed Snake": {"description": "A robust, slow-moving snake that averages 35-50 cm in length but may reach 85 cm. It is nocturnal and inhabits humic soil in well-wooded and forested areas as well as grassland where it is seldom seen.", "type": "Non Venomous"}, "Olive Grass Snake": {"description": "The Olive Grass Snake is the largest grass snake in Africa, averaging 1-1,5 m but reaching 1,8 m in length. It is a slender, fast-moving snake that is quick to disappear when disturbed. It usually moves with the first third of the body raised off the ground in a similar manner to the Black Mamba or Boomslang.", "type": "Non Venomous"}, "Olive Snake": {"description": "A slow-moving nocturnal snake that is quite similar to the Brown House Snake in behaviour. It averages 30-60 cm but reaches 1.3 m in length. Commonly found around houses but prefers damp areas where it hunts for lizards, rodents and other snakes. Because of its colour, varying from olive-green to light brown or black, it is mistaken for a variety of other snakes including the Black Mamba and the Brown Water Snake.", "type": "Non Venomous"}, "Péringuey’s Adder": {"description": "A small adder that averages 25 cm in length. This is a desert specialist that inhabits the soft wind-blown dunes of the Namib Desert.", "type": "Non Venomous"}, "Peters’ Thread Snake": {"description": "A very small, thin snake with highly polished scales and averages around 15-20 cm in length. The thread snakes resemble worms and it can be difficult to distinguish the head from the tail. They are burrowing snakes with cylindrical bodies and minute eyes. They feed on invertebrates, especially termites and ants.", "type": "Non Venomous"}, "Plain Mountain Adder": {"description": "A small adder averaging 30 cm with a maximum size of 35 cm. This endemic snake is listed as Endangered in the current Reptile Atlas. It is largely limited to grasslands above 1,500 masl in the Sneeuberg range and the surrounding mountains of Graaff-Reinet.", "type": "Non Venomous"}, "Puff Adder": {"description": "The Puff Adder is widespread over much of sub-Saharan Africa. It is a heavy-bodied snake that relies on its excellent camouflage and is reluctant to move.", "type": "Venomous"}, "Pygmy Wolf Snake": {"description": "A harmless little snake that averages 15-25 cm with a maximum length of 30 cm. The Pygmy Wolf Snake inhabits lowland forests, grasslands and mesic savanna in northern Zululand northwards into southern Mozambique.", "type": "Non Venomous"}, "Red Adder": {"description": "A small adder averaging around 30 cm with a maximum length of 44 cm. The Red Adder is endemic to the Western Cape and adjacent Northern Cape as well as the western Eastern Cape where it inhabits rocky mountain slopes and gravel flats in the Klein Karoo and Fynbos.", "type": "Non Venomous"}, "Reticulated Centipede-eater": {"description": "A smallish slender snake that averages 40 cm with a maximum length of 54 cm. It is grey to olive brown above, often with dark-edged scales, and with a dark collar on the nape. Juveniles have up to 12 dark blotches down the neck onto the back that fade with age.", "type": "Non Venomous"}, "Rinkhals": {"description": "The Rinkhals is endemic to Southern Africa and is found only in South Africa, eSwatini, Lesotho and eastern Zimbabwe. Though it resembles a cobra (spreads a hood) it is not a true cobra and gives birth to live young. It is essentially a grassland inhabitant but is also found in fynbos in the Western Cape. It is fond of wetlands where it feeds on frogs.", "type": "Venomous"}, "Rufous Beaked Snake": {"description": "A large diurnal snake that averages 70-100 cm with a maximum length of 1.6 m. It is slow-moving whilst hunting on the surface and will often do so with its head well off the ground but spends much of the day in rodent burrows in search of food. Known for its peculiar habit of moving its head from side to side – something that may be seen in the Boomslang as well.", "type": "Non Venomous"}, "Schinz’s Beaked Blind Snake": {"description": "A smallish blind snake averaging 15–20 cm with a maximum length of 29 cm. It inhabits dry savanna, karoo scrub and semi-desert regions of the north-western Northern Cape, Namibia and western Botswana.", "type": "Non Venomous"}, "Schlegel’s Blind Snake": {"description": "This is one of Africa’s largest Blind snakes averaging 60cm but may reach a length of 80 cm. It spends most of its life underground where it feeds on termites and their larvae but often emerges after heavy rain. Otherwise, it may be found under logs or rocks or may be exposed during earth moving operations.", "type": "Non Venomous"}, "Semiornate Snake": {"description": "A beautifully-marked grey snake that is active during the day when it hunts for geckos and lizards. It is seldom encountered and hides in rotten logs and under the bark of trees. This snake climbs well and may be seen in trees and thick vegetation along rivers. It is quick to escape when disturbed and seldom attempts to bite.", "type": "Non Venomous"}, "Short-snouted Grass Snake": {"description": "A medium sized, fast-moving snake that is active during the day. It averages 40-60cm but may exceed a meter in length. This snake is fond of basking and very quick to escape. It may flee into low shrubs.", "type": "Non Venomous"}, "Snouted Cobra": {"description": "The Snouted Cobra is largely a moist and dry savannah inhabitant, but is also found in Lowveld and bushveld areas where it actively hunts its prey.", "type": "Venomous"}, "Snouted Night Adder": {"description": "The Snouted Night Adder is very similar to the Rhombic Night Adder in appearance and behaviour, but is much smaller, averaging 35 cm, with a maximum length of 43 cm. It generally occurs further east than the Rhombic Night Adder, but their distributions do overlap.", "type": "Non Venomous"}, "South-western Shovel-snout": {"description": "A long shovel-snout averaging 20-30 cm with a maximum length of 44 cm. Unlike other shovel-snouts, it doesn’t have an enlarged shovel on the snout and is less fossorial than other species. ", "type": "Non Venomous"}, "Southern Adder": {"description": "A small adder averaging 28 cm with a maximum length of just over 40 cm. It has a limited distribution in low-lying coastal Fynbos in the Western Cape where much of its habitat has been destroyed. The Southern Adder is listed as Vulnerable in the latest reptile Atlas.", "type": "Non Venomous"}, "Southern African Python": {"description": "The Southern African Python is a large snake reaching a maximum length of around 5.5 m and weighing around 65 kg. It feeds largely on warm-blooded prey like small antelope, monkeys, game birds and dassies, but also takes leguaans and even crocodiles.", "type": "Non Venomous"}, "Southern Brown Egg-eater": {"description": "A harmless egg-eating snake that averages 75 cm but may exceed 1 m in length. It is active at night and is amazingly skilled at finding birds’ eggs. These snakes can be problematic for bird breeders as several eggs can be devoured in a single session.", "type": "Non Venomous"}, "Southern Vine Snake": {"description": "This perfectly-camouflaged tree-living snake is seldom seen because of its excellent camouflage and habit of remaining very still in low shrubs, observing the ground below for passing lizards and snakes.", "type": "Non Venomous"}, "Speckled Quill-snouted Snake": {"description": "A colourful nocturnal snake that is usually yellow in colour with dark speckling down the back. It is fossorial, only coming to the surface on hot, moist summer nights.", "type": "Non Venomous"}, "Speckled Shield-nose Snake": {"description": "A smallish nocturnal snake that averages 40 – 45 cm in length and with a maximum length of 65 cm. It spends most of its time foraging in loose sand in search of small mammals, frogs and especially legless lizards, using its large rostral scale as a bulldozer.", "type": "Non Venomous"}, "Spotted Bush Snake": {"description": "A common, slender green snake that usually has dark spots on the first third of the body and a plain green or coppery-brown tail. The eyes are bright orange and the chin and upper lips pale. ", "type": "Non Venomous"}, "Spotted Harlequin Snake": {"description": "This colourful little snake averages 30 – 40 cm with a maximum length of 65 cm. It varies greatly in colour, depending on locality, and is found in fynbos, lowland forest, moist savanna and grassland.", "type": "Non Venomous"}, "Spotted Rock Snake": {"description": "A smallish snake that averages under 50 cm in length but may reach 1,2 m. The Spotted Rock Snake is a secretive snake that inhabits narrow rock crevices where it feeds on lizards, mainly geckos, but may also take rodents and nestling birds. It hunts at night and may be found crossing roads.", "type": "Non Venomous"}, "Spotted Skaapsteker": {"description": "A fast-moving diurnal snake that inhabits grasslands, fynbos, moist savanna and semi-desert areas. It is a nervous snake and is quick to escape, either into a bush or grass tuft or under a rock. The name ‘Skaapsteker’ came from the mistaken belief that these abundant snakes accounted for sheep deaths, when the actual culprit was probably the Cape Cobra.", "type": "Non Venomous"}, "Striped Harlequin Snake": {"description": "A small snake averaging 20 cm with a maximum length of 32 cm. This snake is endemic to South Africa and eSwatini and is currently listed as Near Threatened in the latest Reptile Atlas.", "type": "Non Venomous"}, "Striped Skaapsteker": {"description": "A common diurnal snake that frequents vlei-areas, open grasslands and lowland savannah. It is often found under building rubble near towns. It is very quick to escape and will usually coil around a grass tuft and remain absolutely still.", "type": "Non Venomous"}, "Sundevall’s Garter Snake": {"description": "A secretive snake that is largely seen at night especially on roads. It is slate grey in colour with 19 – 38 pale bands on the body and tail that fade with age. Juveniles are vividly marked alternating black and tan or orange bands.", "type": "Non Venomous"}, "Sundevall’s Shovel-snout": {"description": "Description not available.", "type": "Non Venomous"}, "Swazi Rock Snake": {"description": "A rock-living snake that inhabits narrow rock crevices in grasslands and savanna. It averages 60 cm but may exceed 90 cm in length. ", "type": "Non Venomous"}, "Two-striped Shovel-snout": {"description": "A greyish to purple-brown or reddish brown snake with a broken orange to yellow stripe down the vertebrae often with black spots or blotches.", "type": "Non Venomous"}, "Variegated Slug-eater": {"description": "A harmless snake that feeds on slugs and snails. Adults average 30 cm but may reach a length of 40 cm. This snake is secretive and slow-moving and may be encountered during the day or at night, usually moving along in decaying vegetation. It is quite common in parts of its distribution. Unlike the Common Slug-eater, this snake does not roll into a protective spiral.", "type": "Non Venomous"}, "Variegated Wolf Snake": {"description": "An inoffensive nocturnal snake that inhabits rocky outcrops in moist savanna. It is a small snake that averages 30 cm with a maximum length of 43.3 cm.", "type": "Non Venomous"}, "Viperine Rock Snake": {"description": "A slender and docile snake that averages around 28 cm but can reach 30cm in length. These secretive snakes hide in deep rock cracks. ", "type": "Non Venomous"}, "Western Keeled Snake": {"description": "A nocturnal snake that inhabits rocky desert areas of Namibia and elsewhere further north. The Western Keeled snake averages 50 cm but can reach 80 cm in length. Females are larger than males. This snake feeds on lizards, especially geckos, and skinks, but will also take small rodents and even birds.", "type": "Non Venomous"}, "Western Natal Green Snake": {"description": "A beautiful, bright green snake that is active during the day when it hunts for geckos and frogs. This snake climbs well but is often found on the ground, especially along the banks of well-shaded rivers and streams. It is quick to escape when disturbed and will bite readily if handled but is completely harmless.", "type": "Non Venomous"}, "Western Thread Snake": {"description": "A small thread snake that averages 20 cm with a maximum length of 32.2 cm. Unlike many of the other blackish thread snakes this one is light brown to purplish brown or pink in colour and with a paler belly.", "type": "Non Venomous"}, "Western Tiger Snake": {"description": "A colourful nocturnal snake that is orange-pink to salmon pink above with 52 – 75 dark blotches on the body and tail. It inhabits rocky areas or hides under the bark of trees.", "type": "Non Venomous"}, "Western Yellow-bellied Sand Snake": {"description": "A fast-moving, slender snake that averages 50-80 cm. This snake is active during the day and is without doubt one of our fastest snakes. It is fond of basking but will move off rapidly if disturbed. It is comfortable in trees and shrubs.", "type": "Non Venomous"}, "Yellow-bellied House Snake": {"description": "A smallish snake averaging 40 cm with a maximum length of 76 cm. The Yellow-bellied House Snake is secretive and active at night. Individuals are found in termite mounds, under large rocks or may be seen crossing roads at night. It feeds on lizards and small rodents.", "type": "Non Venomous"}, "Yellow-bellied Sea Snake": {"description": "A medium-sized snake that averages 60 cm but may reach a meter in length. It is the most widely distributed sea snake in the world and is found in most warm oceans. ", "type": "Non Venomous"}, "Zambezi Blind Snake": {"description": "One of the larger blind snakes that inhabits hard substrates including termitaria in Mopaneveld and Lowveld regions of northern Limpopo extending into Mozambique and Zimbabwe as well as eastern Botswana.", "type": "Non Venomous"}, "Zebra Cobra": {"description": "The Zebra Cobra occurs from central Namibia northwards into Angola. It averages 1.2 m and may exceed 1.5 m in length. It is largely nocturnal and is often found on tarred roads, especially after rain.", "type": "Venomous"}, "African Rock Python": {"description": "The African Rock Python is a large snake reaching a maximum length of around 6.5 m. It feeds largely on warm-blooded prey like small antelope, monkeys, game birds and dassies, but also takes leguaans and even crocodiles. ", "type": "Non Venomous"}, "Eastern Green Mamba": {"description": "A bright green snake that inhabits coastal and thick montane forest. It is also comfortable in plantations such as Mango and some nuts. It is often confused with harmless green snakes of the genus Philothamnus and the green Boomslang.", "type": "Non Venomous"}, "Egyptian Cobra": {"description": "The Egyptian Cobra is a large cobra, reaching 2.5m in length. It is widespread in central, eastern and northern Africa. The Moroccan population is treated as a subspecies.", "type": "Venomous"}, "Forest Cobra": {"description": "This is one of Africa’s largest cobras and may exceed 2.7 m in length. Adults are light to medium shiny brown becoming black near the tail. They may also be pitch black or black with light bands. There are now five species in this group throughout Africa.", "type": "Venomous"}, "Forest Vine Snake": {"description": "This perfectly-camouflaged tree-living snake is seldom seen because of its excellent camouflage and habit of remaining very still in low shrubs, observing the ground below for passing lizards and snakes.", "type": "Non Venomous"}, "Herald Snake": {"description": "The Herald Snake, also known as the Red-lipped or White-lipped Snake, is nocturnal and averages 30-50 cm in length. It is olive-brown to grey in colour, usually with white flecks on the body and with iridescent black temples.", "type": "Non Venomous"}, "Jameson’s Mamba": {"description": "A dull green snake mottled with black and yellow, that inhabits coastal and thick montane forest. it is also comfortable in plantations, such as Mango and some nuts, as well as around buildings.", "type": "Venomous"}, "Night Adders": {"description": "These short adders can be tricky to tell apart. Both the Forest Night Adder (red distribution) and the Common Night Adder (yellow distribution) are short snakes of around 45 cm, but may exceed 80 cm. They are diurnal, hunting frogs and toads.\nA prominent V pattern is visible behind the head.", "type": "Non Venomous"}, "North-east African Carpet Viper": {"description": "Found in semi-desert and dry savanna. It is very common in its range and accounts for many snakebites and fatalities a year.", "type": "Non Venomous"}, "Red Spitting Cobra": {"description": "A small cobra reaching a maximum length of around 1.5 meters. The Red Spitting Cobra is active at night, hiding during the day.", "type": "Venomous"}, "Rhino-horned Viper": {"description": "The Rhino-horned Viper is widespread over much of the tropical forests of the equators. It is a heavy-bodied snake that relies on its excellent camouflage and is reluctant to move.", "type": "Venomous"}, "Saharan Horned Viper": {"description": "These short vipers are common in sandy habitats and sand dunes of the Saharan desert into the Arabian Peninsula. The Saharan Horned Viper is a small snake of around 30 cm with a maximum size of around 50 cm. They are nocturnal and actively hunt at night. During the day this snake hides under bushes or buried in the sand.", "type": "Venomous"}, "Saharan Sand Viper": {"description": "These short vipers are common in sandy habitats and sand dunes of the Saharan desert into the Arabian Peninsula. The Saharan Sand Viper is a small snake of around 30 cm with a maximum size of around 50 cm. They are nocturnal and actively hunt at night. During the day this snake hides under bushes or buried in the sand.", "type": "Venomous"}, "Stiletto Snakes": {"description": "There are around 20 species of Stiletto Snakes in central Africa. These are small snakes averaging around 30cm that may reach 80cm.", "type": "Non Venomous"}, "West African Carpet Viper": {"description": "This is a savanna species. It is very common in its range and accounts for many snakebites and fatalities a year. They are nocturnal and many people stand on them at night. It is an ambush hunter that will coil up into a striking position and await its prey. They have adapted to semi-urban areas and often hunt near human dwellings.", "type": "Venomous"}, "Western Gaboon Adder": {"description": "A large, robust adder that averages 1.2 meters, but may exceed 2 m. This beautifully-coloured snake occurs in thick tropical and coastal forest.", "type": "Venomous"}, "Western Green Mamba": {"description": "A dull green to light blue snake snake mottled with black and yellow, that inhabits coastal and tropical forest.", "type": "Venomous"}}